# part-2 pandas

In [1]:
import numpy as np
old=np.array([[1,1,1],[1,1,1]])
new=old
new[0:2,:1]=0
print(new)

[[0 1 1]
 [0 1 1]]

In [2]:
import numpy as np
old=np.array([[1,1,1],[1,1,1],[1,1,1]])
new=old
new[1:2,1:2]=0
print(new)

[[1 1 1]
 [1 0 1]
 [1 1 1]]

In [93]:
import numpy as np
old=np.array([[1,1,1],[1,1,1],[1,1,1]])
new=old
new[:,1:2]=0
print(new)

[[1 0 1]
 [1 0 1]
 [1 0 1]]

In [21]:
import numpy as np
import pandas as pd
animals=["tiger","bear","mouse"]
pd.Series(animals)

0    tiger
1     bear
2    mouse
dtype: object

In [22]:
numbers=[1,2,None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [23]:
np.nan==np.nan

False

In [47]:
import numpy as np
np.nan==None

False

In [49]:
np.isnan(np.nan)

True

In [30]:
sports={'archery':'bhutan',
       'golf':'scotland'}
s=pd.Series(sports)
s

archery      bhutan
golf       scotland
dtype: object

# Querying a series

In [35]:
sports={'archery':'bhutan','golf':'scotland','sumo':'japan'}
s=pd.Series(sports)
s

archery      bhutan
golf       scotland
sumo          japan
dtype: object

In [36]:
s.iloc[2]

'japan'

In [37]:
s.loc['golf']

'scotland'

In [40]:
sports={99:'bhutan',
       100:'japan',
       101:'south korea'}
s=pd.Series(sports)
s[101]

'south korea'

In [39]:
s.iloc[0]

'bhutan'

In [41]:
s[99]

'bhutan'

# working with data

In [44]:
s=pd.Series([100.00,120.00,101.00,3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [45]:
total=0
for item in s:
    total+=item
print(total)

324.0

In [46]:
import numpy as np
total=np.sum(s)
print(total)

324.0

In [52]:
s=pd.Series(np.random.randint(0,1000,10000))
s.head()

0    310
1    791
2    545
3    156
4     11
dtype: int64

In [53]:
s=pd.Series(np.random.randint(0,1000,10000))
s

0       878
1       148
2       610
3       579
4       997
5       820
6       725
7       140
8        47
9       800
10       94
11      816
12      131
13      727
14      702
15      716
16      287
17      876
18      978
19       70
20      960
21      856
22      299
23       16
24      220
25      788
26      584
27      305
28      482
29      512
       ...
9970    388
9971    741
9972    488
9973    438
9974    482
9975    271
9976    182
9977    114
9978     91
9979    308
9980    218
9981     93
9982    377
9983    531
9984    692
9985    582
9986    503
9987    799
9988    303
9989    824
9990    893
9991    417
9992    368
9993    800
9994    778
9995    992
9996    148
9997    831
9998    216
9999    857
Length: 10000, dtype: int64

In [54]:
len(s)

10000

In [57]:
%%timeit -n 100
summary=0
for item in s:
    summary+=item

773 µs ± 75.3 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [56]:
%%timeit -n 100
summary=np.sum(s)

43.4 µs ± 8.48 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

# BROAD CASTING

In [58]:
s+=2
s.head()

0    880
1    150
2    612
3    581
4    999
dtype: int64

In [60]:
s=pd.Series([1,2,3])
s.loc['animal']='bears'
s

0             1
1             2
2             3
animal    bears
dtype: object

In [61]:
s=pd.Series([1,2,3])
s

0    1
1    2
2    3
dtype: int64

In [66]:
original_sports=pd.Series({'archery':'bhutan','golf':'scotland','sumo':'japan','taekwondo':'south korea'})
cricket_loving_countries=pd.Series(['australia','india','pakistan','england'],index=['cricket','cricket','cricket','cricket'])
all_countries=original_sports.append(cricket_loving_countries)

In [67]:
all_countries.loc['cricket']

cricket    australia
cricket        india
cricket     pakistan
cricket      england
dtype: object

# Data frame data structure

In [71]:
import pandas as pd
purchase_1=pd.Series({'Name':'deva','item purchased':'food','cost':22.50})
purchase_2=pd.Series({'Name':'surya','item purchased':'drink','cost':2.50})
purchase_3=pd.Series({'Name':'sainath','item purchased':'chocolate','cost':5.00})
df=pd.DataFrame([purchase_1,purchase_2,purchase_3],index=['store1','store1','store2'])
df.head()

           Name  cost item purchased
store1     deva  22.5           food
store1    surya   2.5          drink
store2  sainath   5.0      chocolate

In [72]:
type(df.loc['store2'])

pandas.core.series.Series

In [73]:
df.loc['store2']

Name                sainath
cost                      5
item purchased    chocolate
Name: store2, dtype: object

In [74]:
df.loc['store1']

         Name  cost item purchased
store1   deva  22.5           food
store1  surya   2.5          drink

In [75]:
df.loc['store1','cost']

store1    22.5
store1     2.5
Name: cost, dtype: float64

In [76]:
df.T

               store1 store1     store2
Name             deva  surya    sainath
cost             22.5    2.5          5
item purchased   food  drink  chocolate

In [77]:
df.T.loc['cost']

store1    22.5
store1     2.5
store2       5
Name: cost, dtype: object

In [78]:
df.loc['store1','cost']

store1    22.5
store1     2.5
Name: cost, dtype: float64

In [79]:
df.loc[:,['Name','cost']]

           Name  cost
store1     deva  22.5
store1    surya   2.5
store2  sainath   5.0

In [84]:
df.drop('store1')

           Name  cost item purchased
store2  sainath   5.0      chocolate

In [83]:
df

           Name  cost item purchased
store1     deva  22.5           food
store1    surya   2.5          drink
store2  sainath   5.0      chocolate

In [85]:
copy_df=df.copy()
copy_df=copy_df.drop('store1')
copy_df

           Name  cost item purchased
store2  sainath   5.0      chocolate

In [87]:
copy_df.drop?

In [86]:
del copy_df['Name']
copy_df

        cost item purchased
store2   5.0      chocolate

In [88]:
df['location']=None
df

           Name  cost item purchased location
store1     deva  22.5           food     None
store1    surya   2.5          drink     None
store2  sainath   5.0      chocolate     None

In [89]:
costs=df['cost']
costs

store1    22.5
store1     2.5
store2     5.0
Name: cost, dtype: float64

In [90]:
cost=df['cost']
cost

store1    22.5
store1     2.5
store2     5.0
Name: cost, dtype: float64